In [2]:
%matplotlib inline

In [3]:
import numpy as np
import pandas as pd
from datetime import datetime, timedelta
from collections import defaultdict

In [6]:
path = "/Users/huziy/Downloads/Data2004"
day = timedelta(days=1)
date_format = "%Y%m%d%H"

In [7]:
indf = pd.read_csv(path, sep="\s+", header=None)

In [14]:
indf.head()

      0  1  2  3     4       5        6
0  2004  1  1  0  1907  81.727  178.737
1  2004  1  1  0  1908  78.060 -150.768
2  2004  1  1  0  3690  78.268 -166.780
3  2004  1  1  0  3982  74.142 -146.212
4  2004  1  1  0  5300  85.961 -159.301

In [15]:
outdf = indf.copy()

In [20]:
outdf[7] = indf.apply(
    lambda arow: datetime(*[int(arow[i]) for i in range(4)]).strftime(date_format), axis=1)

outdf[8] = indf.apply(
    lambda arow: (datetime(*[int(arow[i]) for i in range(4)]) + day).strftime(date_format), axis=1)

In [21]:
outdf.head()

      0  1  2  3     4       5        6           7           8
0  2004  1  1  0  1907  81.727  178.737  2004010100  2004010200
1  2004  1  1  0  1908  78.060 -150.768  2004010100  2004010200
2  2004  1  1  0  3690  78.268 -166.780  2004010100  2004010200
3  2004  1  1  0  3982  74.142 -146.212  2004010100  2004010200
4  2004  1  1  0  5300  85.961 -159.301  2004010100  2004010200

In [22]:
st_date_to_lat_lon = {}
for st, data in outdf.groupby(4):
    st_date_to_lat_lon[st] = defaultdict(lambda: (np.nan, np.nan))
    
    for row_i, row in data.iterrows():
        st_date_to_lat_lon[st][row[7]] = (row[5], row[6])

In [25]:
outdf[9] = outdf.apply(lambda arow: st_date_to_lat_lon[arow[4]][arow[8]][0], axis=1)
outdf[10] = outdf.apply(lambda arow: st_date_to_lat_lon[arow[4]][arow[8]][1], axis=1)

In [60]:
# Some dates do not have the corresponding data a day later (so for those I've put nans), 
# If not needed => uncomment the line below

# outdf = outdf.dropna()

In [26]:
outdf.to_csv("test_for_Kamel.csv", sep=" ", index=False, header=False)

In [27]:
outdf.head()

,0,1,2,3,4,5,6,7,8,9,10
0,2004,1,1,0,1907,81.727,178.737,2004010100,2004010200,81.864,178.594
1,2004,1,1,0,1908,78.060,-150.768,2004010100,2004010200,78.159,-150.727
2,2004,1,1,0,3690,78.268,-166.780,2004010100,2004010200,78.422,-166.842
3,2004,1,1,0,3982,74.142,-146.212,2004010100,2004010200,74.202,-146.316
4,2004,1,1,0,5300,85.961,-159.301,2004010100,2004010200,86.127,-159.110

In [28]:
len(indf), len(outdf)

(19348, 19348)